/*
1. 声明数据类型关键字（K&F,C90,C99表示该标准新增的，还有C11）

        K&F                   | C90      |   C99       |   
----------------------------------------------------------------------------------------------------------------
      int                     |          |             |  - 提供基本整数类型
      long,short,unsigned     | signed   |             |  - 提供基本整数类型的变式,如unsigned short int-无符号短整型
      char                    |          |             |  - 指定字母和其他字符(#$^*),也可以表示较小的整数
      float,double,long double|          |             |  - 表示带小数点的数
                              | void     |             |       
                              |          | _Bool       |  - 表示布尔值true false
                              |          | _Complex    |  - 表示复数
                              |          | _Imaginary  |  - 表示虚数
----------------------------------------------------------------------------------------------------------------
位(bit)    - 最小存储单元 0或1
字节(Byte) - 是常用计算机存储单元，1字节 = 8位
字(word)   - 是设计给计算机时给定的自然存储单元，常用64位(1字=8字节=64位)，32位(1字=4字节=32位)操作系统
             对于8位的微型计算机（如最初的苹果机）,1字=1字节=8位

2. 浮点数与整数的存储方案
2.1 整数
  7    0000 0000 0000 0111
  一般占用一个机器字长，早期16位系统存储一个int值，首位符号位（-32768 ~ 32767），现在都64位系统了，不过ISO C规定还用16位来存储

2.2浮点数
  3.14159转为科学记数法0.314159E1即0.314159 * 10^1      +(符号位)  .314159(小数)  1(指数位) 计算机在内部用二进制和2的幂进行存储

*/


#include<stdio.h>

int main(void) {

  // 整型  现在最常见的设置是: long long 占64位，long 占32位，short 占16位，int 占16位或者32位
  int num1 = 1; // 16位机范围-32767~32767（我的占用32位） ,需要32位用long,64位用long long
  
  short int s_num1 = 1; // 短整型，等于short S_num    C语言规定short占用存储空间不能多于int
  long l_num1 = 1; // 长整形    存储空间不能少于int
  unsigned int u_num = 1; // 无符号整型
  signed int s_num = 1; // 有符号整型，与int声明一样

  // 数字后缀可以指定存储类型
  // 如7L(或小写L - l)表示用用long位存储数字(也可用于八进制或十六进制020L,0x20L)
  // 另外，u 或者 U 后缀可以表示unsigned,如 5ull, 6LLU, 9ULL


  // 浮点型
  float num2 = 1.123456789;
  double num3 = 1.123456789;

  printf("num1 - int: %d\nnum2 - float: %f\nnum3 - double: %f\n", num1, num2, num3);

  char *str = "1"; // *-定义指针

  float weight;
  float value;

  scanf("%f", &weight); // %f-说明要读取用户输入的浮点数; &weight-找到weight变量的地点

  value = 1700.0 * weight * 14.5833;

  printf("value is %.2f\n", value); // %.2f 指定浮点数只显示小数点后2位

  getchar(); // 第一个getchar()读取上面的换行符
  getchar(); // 第二个让程序暂停，等待输入

  return 0;
}